IdeaRS.OpenModel.OpenModel.Opening
List of openings for Detail

IdeaRS.OpenModel.OpenModel.DappedEnd
List of dapped ends in Detail

IdeaRS.OpenModel.OpenModel.PatchDevice
List of dapped ends in Detail

IdeaRS.OpenModel.OpenModel.Beam
List of Elements 1D

IdeaRS.OpenModel.OpenModel.Wall
List of Elements 2D

IdeaRS.OpenModel.OpenModel.Connections
List of Connection data

IdeaRS.OpenModel.OpenModel.Reinforcement
List of reinforcement in IDEA StatiCa Detail

IdeaRS.OpenModel.OpenModel.ISDModel
List of Details

IdeaRS.OpenModel.OpenModel.ResultClass
Result Class

IdeaRS.OpenModel.OpenModel.CheckMember
List of the Check members

IdeaRS.OpenModel.OpenModel.ConcreteCheckSection
List of the concrete check section

IdeaRS.OpenModel.OpenModel.ConcreteSetup
Gets or sets the concrete member data

IdeaRS.OpenModel.OpenModel.ProjectDataConcrete
Gets or sets the projet data concrete

IdeaRS.OpenModel.OpenModel.LoadFromString(System.String)
Creates the instance of Open Model from xml string
xmlString: The input string
Returns: The new instance of Open Model